# Example 3

RIGHT JOIN

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../data_base.db')
cur = con.cursor()

## SQL statement

In [3]:
# The RIGHT JOIN keyword returns all records from the right table (table2), and the matching records from the left table (table1). 
# The result is 0 records from the left side, if there is no match.
# SELECT column_name(s)
# FROM table1
# RIGHT JOIN table2 ON table1.column_name = table2.column_name

query = '''
            SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
            FROM Orders
            RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
            ORDER BY Orders.OrderID
        '''

## Show table

In [4]:
df = pd.read_sql_query(query, con)
df.head()

   OrderID   LastName FirstName
0      NaN       West      Adam
1  10248.0   Buchanan    Steven
2  10249.0     Suyama   Michael
3  10250.0    Peacock  Margaret
4  10251.0  Leverling     Janet

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 197 entries, 0 to 196
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderID    196 non-null    float64
 1   LastName   197 non-null    object
 2   FirstName  197 non-null    object
dtypes: float64(1), object(2)
memory usage: 4.7+ KB

## Close the connection

In [6]:
# Save (commit) the changes
con.commit()

# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
con.close()